# Firstly Import Pandas

In [9]:
import pandas as pd

In [18]:
set = {'Name':['Bittu','Mark','Ankush','Vishal','Abhishek','Sumit','Amit','Ankit','Yadav','Kumar'],
       'Marks':[98,56,89,74,96,86,78,59,82,80],
       'Gender':['M','G','M','M','G','M','G','G','M','M']
       };

df = pd.DataFrame(set)
df

       Name  Marks Gender
0     Bittu     98      M
1      Mark     56      G
2    Ankush     89      M
3    Vishal     74      M
4  Abhishek     96      G
5     Sumit     86      M
6      Amit     78      G
7     Ankit     59      G
8     Yadav     82      M
9     Kumar     80      M

# Print Total Data About Your DataSet

In [86]:
df

       Name  Marks Gender
0     Bittu     98      M
1      Mark     56      G
2    Ankush     89      M
3    Vishal     74      M
4  Abhishek     96      G
5     Sumit     86      M
6      Amit     78      G
7     Ankit     59      G
8     Yadav     82      M
9     Kumar     80      M

# Display Top 3 Rows

In [89]:
df.head(3)

     Name  Marks Gender
0   Bittu     98      M
1    Mark     56      G
2  Ankush     89      M

# Display Last 3 Rows

In [88]:
df.tail(3)

    Name  Marks Gender
7  Ankit     59      G
8  Yadav     82      M
9  Kumar     80      M

# Find the Shape of the DataSet

In [34]:
print(df.shape)
print("Number of Rows", df.shape[0])
print("Number of Columns", df.shape[1])

(10, 3)
Number of Rows 10
Number of Columns 3

# Get Info. About Your Dataset

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks   10 non-null     int64
 2   Gender  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

# Check Null Valuse in Dataset

In [46]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False   False
8  False  False   False
9  False  False   False

# Check Null Valuse in Dataset with Counts

In [45]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

# OverAll Statistic Info About Your DataSet

In [50]:
df.describe(include = 'all')

         Name     Marks Gender
count      10  10.00000     10
unique     10       NaN      2
top     Bittu       NaN      M
freq        1       NaN      6
mean      NaN  79.80000    NaN
std       NaN  13.97458    NaN
min       NaN  56.00000    NaN
25%       NaN  75.00000    NaN
50%       NaN  81.00000    NaN
75%       NaN  88.25000    NaN
max       NaN  98.00000    NaN

# Find Unique valuer in particular Columns

In [93]:
df['Gender'].unique()

array(['M', 'G'], dtype=object)

# Find the number of Unique valuer in particular Columns

In [56]:
df['Gender'].nunique()

2

In [61]:
df['Gender'].value_counts()

Gender
M    6
G    4
Name: count, dtype: int64

# Find the total number of student having Markes above the 70?

In [65]:
df[df['Marks']>=70]

       Name  Marks Gender
0     Bittu     98      M
2    Ankush     89      M
3    Vishal     74      M
4  Abhishek     96      G
5     Sumit     86      M
6      Amit     78      G
8     Yadav     82      M
9     Kumar     80      M

# Find the total number of student having Markes between the 70  to 90?

In [98]:
df[(df['Marks']>=70) & (df['Marks']<=90)]

     Name  Marks Gender
2  Ankush     89      M
3  Vishal     74      M
5   Sumit     86      M
6    Amit     78      G
8   Yadav     82      M
9   Kumar     80      M

# Mean  & Max Values

In [105]:
df['Marks'].mean()
df['Marks'].max()

98